## 空的DataFrame

In [3]:
import pandas as pd

df = pd.DataFrame(index=['a', 'b', 'c', 'd'])
print(df)

df['floats'] = [1.5, 2.5, 3.5, 4.5]
df['names1'] = ('Yves', 'Guido', 'Felix', 'Francesc')
df['names2'] = pd.DataFrame(['Yv', 'Gu', 'Fe', 'Fr'],
                            index=['d', 'a', 'b', 'c']) # 添加新的DataFrame对象。
print(df)

Empty DataFrame
Columns: []
Index: [a, b, c, d]
   floats    names1 names2
a     1.5      Yves     Gu
b     2.5     Guido     Fe
c     3.5     Felix     Fr
d     4.5  Francesc     Yv

## 用列表创建

- 创建时可以用`index`指定行标签，`columns`来指定列标签，不指定默认为0。
- 当传入一个单维列表的，默认将该列表作为DataFrame中的第一列
- 当传入一个二维列表时(`np.random.standard_normal((9, 4)).round(6)`)，那么每行对应DataFrame中的一行。

In [3]:
import pandas as pd
students = ['Lisha', 'Shelly', 'Greay', 'Leo', 'Marry']

# 单个列表会作为新建dataframe的单列
df1 = pd.DataFrame(students)
print("with no column lable:\n", df1)
df2 = pd.DataFrame(students, columns=['name'])
print("with specified column lable:\n", df2)

with no column lable:
         0
0   Lisha
1  Shelly
2   Greay
3     Leo
4   Marry
with specified column lable:
      name
0   Lisha
1  Shelly
2   Greay
3     Leo
4   Marry

In [2]:
import pandas as pd

students = ['Lisha', 'Shelly', 'Greay', 'Leo', 'Marry']

pd.DataFrame(columns=[students])
#pd.DataFrame([students])

       0       1      2    3      4
0  Lisha  Shelly  Greay  Leo  Marry

In [6]:
import pandas as pd

nest_list = [['cbxxx_1UE', 24491],
             ['cbxxx_2UE', 24492]]
pd.DataFrame(nest_list, columns=['Case', 'Build'])

        Case  Build
0  cbxxx_1UE  24491
1  cbxxx_2UE  24492

In [7]:
nest_list = [['cbxxx_1UE', 24491],
             ['cbxxx_2UE', 24492]]
pd.DataFrame(nest_list, index=['i1', 'i2'], columns=['c1', 'c2'])

           c1     c2
i1  cbxxx_1UE  24491
i2  cbxxx_2UE  24492

## 添加新列

In [ ]:
df = pd.DataFrame([10, 20, 30, 40],
                  columns=['numbers'],
                  index=['a', 'b', 'c', 'd'])

df['floats'] = (1.5, 2.5, 3.5, 4.5)
df['names1'] = ('Yves', 'Guido', 'Felix', 'Francesc')
df['names2'] = pd.DataFrame(['Yv', 'Gu', 'Fe', 'Fr'],
                            index=['d', 'a', 'b', 'c']) # 添加新的DataFrame对象。
print(df)

## 使用元组

元组和列表的形式是类似的，只不过元组无法修改元素但是列表可以。

In [1]:
import pandas as pd

data = [('Facebook', 750, True),
        ('Alphabet', 1100, True),
        ('Amazon', 1700, True),
        ('Apple', 2100, False),
        ('Microsoft', 1750, False)]

pd.DataFrame(data, columns=['Name', 'M-cap', 'Internet Companies'])

        Name  M-cap  Internet Companies
0   Facebook    750                True
1   Alphabet   1100                True
2     Amazon   1700                True
3      Apple   2100               False
4  Microsoft   1750               False